Repository: Kostenkov-2021/quickDictionary
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, ru, tr

source: edit text before sending
ru: редактировать текст перед отправкой

source: choose online service
ru: выбор онлайн-сервиса
tr: çevrimiçi hizmeti seçin

source: Voice synthesizers profiles
ru: Профили голосовых синтезаторов
tr: Ses sentezleyici profilleri

source: &Options...
ru: Па&раметры...
tr: &Seçenekler...

source: help on add-on commands
ru: справка по командам дополнения
tr: eklenti komutları hakkında yardım

source: He&lp
ru: Спра&вка

source: then press %s for help
ar: ثم اضغط %s للحصول على المساعدة
ru: потом нажмите %s для получения справки
tr: Yardım için %s tuşuna basın

source: announce the dictionary entry for the currently selected word or phrase (the same as %s)
ar: يعلن عن إدخال القاموس للكلمة أو العبارة المحددة حاليًا (مثل %s)
ru: произнести словарную статью для выбранного слова или словосочетания (то же самое, что и %s)
tr: seçili kelime veya kelime öbeği için sözlük girişini söyle (%s ile aynı)

source: show dictionary entry in a separate browseable window
ar: عرض إدخال القاموس في نافذة منفصلة قابلة للتصفح
ru: показать словарную статью в отдельном окне для просмотра
tr: sözlük girişini tarama kipinde ayrı bir pencerede göster

source: announce the current source and target languages
ar: يعلن عن المصدر الحالي ولغات الهدف
ru: произнести текущий исходный язык и язык перевода
tr: mevcut kaynak ve hedef dilleri bildir

source: Translate: from {langFrom} to {langInto}
ar: الترجمة: من {langFrom} الى {langInto}
ru: Перевести: из {langFrom} на {langInto}
tr: Çevir: kaynak {langFrom}, hedef {langInto}

source: swap languages and get Quick Dictionary translation
ar: تبديل اللغات والحصول على ترجمة القاموس السريع
ru: изменить порядок языков и получить быстрый перевод
tr: dilleri değiştir ve Çabuk Sözlük çevirisini al

source: Languages swapped
ar: تم تبديل اللغات
ru: Порядок языков изменено
tr: Diller değiştirildi

source: Swap languages is not available for this pair
ar: تبديل اللغات غير متوفر لهذا الزوج من اللغة
ru: Обратный порядок недоступен для этой пары языков
tr: Bu çift için dil değiştirilemez

source: copy last dictionary entry to the clipboard
ar: نسخ إدخال القاموس الأخير إلى الحافظة
ru: скопировать результат последнего запроса в буфер обмена
tr: son sözlük girişini panoya kopyala

source: There is no dictionary queries
ar: لا توجد استفسارات عن القاموس
ru: Еще не выполнялись запросы к словарю
tr: Sözlük sorgusu yok

source: download from online dictionary and save the current list of available languages
ar: قم بتنزيل القاموس من على الإنترنت وحفظ القائمة الحالية للغات المتاحة
ru: загрузить из онлайн-словаря и сохранить актуальный список доступных языков
tr: çevrimiçi sözlükten indir ve mevcut dil listesini kaydet

source: The list of available languages ​​has been successfully downloaded and saved.
ar: تم بنجاح تنزيل وحفظ قائمة اللغات المتاحة.
ru: Список доступных языков успешно загружен и сохранён.
tr: Mevcut dil listesi başarıyla indirildi ve kaydedildi.

source: Warning! The list of available languages could not be loaded.
ar: تحذير! لا يمكن تحميل قائمة اللغات المتاحة.
ru: Внимание! Не удалось загрузить список доступных языков.
tr: Uyarı! Mevcut dil listesi yüklenemedi.

source: statistics on the using the online service
ru: статистика использования онлайн-сервиса
tr: çevrimiçi hizmetin kullanımına ilişkin istatistikler

source: supports {number} languages
ru: поддерживает {number} языков
tr: {number} dili destekler

source: &Dictionary:
ru: С&ловарь:
tr: &Sözlük:

source: performed {count} requests
ru: выполнено {count} запросов
tr: {count} istek işlendi

source: available {remain}
ru: доступно {remain}
tr: {remain} kaldı

source: the limit will be reset in {hours} hours {minutes} minutes
ru: ограничение будет сброшено через {hours} часов {minutes} минут
tr: Limit {hours} saat {minutes} dakika içinde sıfırlanacak

source: state of cache
ru: состояние кеша
tr: önbellek durumu

source: switch to add-on control mode
ar: قم بالتبديل إلى وضع التحكم الإضافي
ru: переключение в режим управления дополнением
tr: Çabuk Sözlük kipini aç

source: to get a quick translation of a word or phrase - press %s twice
ar: للحصول على ترجمة سريعة للكلمة أو العبارة - اضغط على %s مرتين
ru: чтобы быстро перевести слово или словосочетание - дважды нажмите %s
tr: bir kelime veya cümlenin çabuk çevirisini almak için - iki kez %s basın

source: In add-on gestures layer mode:
ar: في وضع طبقة الإيماءات الإضافية:
ru: В режиме управления дополнением:
tr: Eklenti hareketleri katman kipinde:

source: Voice synthesizers profiles management:
ar: إدارة ملفات تعريف أجهزة التوليف الصوتي:
ru: Управление профилями голосовых синтезаторов:
tr: Ses sentezleyicileri profil yönetimi:

source: for any of the listed features you can customize the keyboard shortcut in NVDA input gestures dialog
ar: بالنسبة لأي من الميزات المدرجة ، يمكنك تخصيص اختصار لوحة المفاتيح في محاورة إيماءات الإدخال
ru: для любой из перечисленных функций вы можете настроить собственную комбинацию клавиш в диалоговом окне "Жесты ввода" NVDA
tr: listelenen özelliklerden herhangi biri için, klavye kısayolunu NVDA girdi hareketleri iletişim kutusunda özelleştirebilirsiniz

source: open add-on settings dialog
ar: فتح مربع حوار إعدادات الوظيفة الإضافية
ru: открывает диалоговое окно настроек дополнения
tr: Çabuk Sözlük eklenti ayarları iletişim kutusunu aç

source: From {startslot} to {endslot} - selection of the voice synthesizer profile
ar: من {startslot} الى {endslot} -اختيار ملف تعريف مُركِّب الصوت
ru: От {startslot} до {endslot} - выбор профиля голосового синтезатора
tr: {startslot} yuvadan {endslot} yuvaya - ses sentezleyici profilinin seçimi

source: Profile {slot} selected: {title}
ar: تم تحديد الملف الشخصي {slot}: {title}
ru: Выбран профиль {slot}: {title}
tr: {slot} profil seçildi: {title}

source: announce the selected profile of voice synthesizers
ar: أعلن عن ملف التعريف المحدد لأجهزة التوليف الصوتي
ru: объявить выбранный профиль речевого синтезатора
tr: Seçili ses sesntezleme profilini bildir

source: display a list of all customized voice synthesizers profiles
ru: показать список всех настроенных профилей синтезаторов голоса
tr: tüm özelleştirilmiş ses sentezleyici profillerinin listesini göster

source: delete the selected voice synthesizer profile
ar: احذف ملف تعريف مُركِّب الصوت المحدد
ru: удаление выбранного профиля речевого синтезатора
tr: seçili ses sentezleyici profilini sil

source: Profile %d successfully deleted
ar: تم حذف ملف التعريف %d بنجاح
ru: Профиль %d успешно удалён
tr: Profil %d başarıyla silindi

source: restore default voice synthesizer
ar: استعادة مركب الصوت الافتراضي
ru: восстановить синтезатор голоса по умолчанию
tr: Varsayılan sentezleyiciye geri dön

source: back to previous voice synthesizer
ru: вернуться к предыдущему синтезатору голоса
tr: Önceki sentezleyiciye geri dön

source: save configured voice synthesizer profile
ar: حفظ الملف الشخصي للتكوين الصوتي
ru: сохранение настроенного профиля синтезатора голоса
tr: yapılandırılmış ses sentezleyici profilini kaydet

source: Voice synthesizer profile saved successfully
ar: تم حفظ ملف تعريف مُركِّب الصوت بنجاح
ru: Профиль синтезатора речи успешно сохранен
tr: Ses sentezleyici profili başarıyla kaydedildi

source: From F1 to F{endgate} - select online dictionary service
ru: От F1 до F{endgate} - выбор службы онлайн-словарей
tr: F1'den F{endgate} e kadar - çevrimiçi sözlük hizmetini seçin

source: No results
ar: لاتوجد نتائج
ru: Отсутствуют данные
tr: Sonuç yok

source: Cebuano
ar: السيبيونو
ru: Себуанский

source: Esperanto
ar: اسبرانتو
ru: Эсперанто

source: Hmong
ar: همونغ
ru: Хмонг

source: Creole Haiti
ar: الكريول هايتي
ru: Креольский Гаити

source: Javanese
ar: الجاوية
ru: Яванский
tr: Cava

source: Latin
ar: لاتيني
ru: Латинский
tr: Latince

source: Malagasy
ar: مدغشقر
ru: Малагасийский
tr: Malgaşça

source: Meadow Mari
ar: مرج ماري
ru: Лукомарийский

source: Hill Mari
ar: هيل ماري
ru: Горномарийский

source: Myanmar (Burmese)
ar: ميانمار (البورمية)
ru: Мьянма (Бирманский)
tr: Myanmar (Birmanya)

source: Chichewa
ar: شيشيوا
ru: Чичева

source: Somali
ar: صومالي
ru: Сомалийский

source: Sesotho
ar: سيسوتو
ru: Сесото

source: Sundanese
ar: السوندانيز
ru: Суданский
tr: Sunda dili

source: Tagalog
ar: تاغالوغ
ru: Тагальский

source: Yiddish
ar: اليديشية
ru: Идиш
tr: Yidiş

source: Select &online service:
ru: Выберите &онлайн-сервис:
tr: &Çevrimiçi hizmeti seçin:

source: Switch between &voice synthesizers for selected languages
ar: التبديل بين آلات الن&طق الصوتية للغات المحددة
ru: Переключение между синтезаторами &голоса для выбранных языков
tr: Seçilen diller için ses &sentezleyicileri arasında geçiş yap

source: Please set up voice synthesizers profiles.
ar: الرجاء إعداد ملفات تعريف مُركِّبات الصوت.
ru: Пожалуйста настройте профили синтезаторов речи.
tr: Lütfen ses sentezleyici profillerini ayarlayın.

source: Select an online service from the list
ru: Выберите онлайн-сервис из списка
tr: Listeden bir çevrimiçi hizmet seçin

source: Online service
ru: Удаленный-сервис
tr: Çevrimiçi hizmet

source: Supported languages
ru: Колличество поддерживаемых языков
tr: Desteklenen diller

source: Changing the profile of the voice synthesizer
ru: Изменение профиля голосового синтезатора
tr: Ses sentezleyici profilini değiştirme

source: Do you want to save changes in profile %d?
ru: Хотите ли Вы сохранить изменения в профиле %d?
tr: Değişiklikleri %d profiline kaydetmek ister misiniz?

source: Create a new voice synthesizer profile
ru: Создать новый профиль синтезатора голоса
tr: Yeni bir ses sentezleyici profili oluşturma

source: Please select the &number for new profile:
ru: Пожалуйста, выберите &номер для нового профиля:
tr: Yeni profil için lütfen bir &numara seçin

source: Select a voice synthesizer &profile from the list
ru: Выберите из списка &профиль речевого синтезатора
tr: Listeden bir ses sentezleyici ve profil seçin

source: Slot
ru: Слот
tr: Yuva

source: Voice synthesizer
ru: Голосовой синтезатор
tr: Ses sentezleyici

source: Associated language
ru: Связанный язык
tr: İlişkili dil

source: &Activate
ru: &Активировать
tr: &Etkinleştir

source: &Change
ru: &Изменить
tr: &Değiştir

source: Profiles list could not be saved
ru: Невозможно сохранить список профилей
tr: Profil listesi kaydedilemedi

source: Saving voice synthesizers profiles list
ru: Сохранение списка профилей голосовых синтезаторов
tr: Ses sentezleyicileri profil listesini kaydetme

source: Copied to clipboard.
ar: نسخ إلى الحافظة.
ru: Скопировано в буфер обмена.
tr: Panoya kopyalandı.

source: Copy failed.
ar: فشل النسخ.
ru: Ошибка копирования.
tr: Kopyalanamadı.

source: There is no selected text, the clipboard is also empty, or its content is not text!
ar: لا يوجد نص محدد ، الحافظة فارغة أيضًا ، أو محتواها ليس نصًا!
ru: Нет выделенного текста и буфер обмена не содержит текстовых данных!
tr: Seçili metin yok, pano da boş veya içeriği metin değil!

source: Lexicala Dictionaries
ru: Словари Lexicala
tr: Lexicala Sözlükleri

source: mean
ar: يعني
ru: значение
tr: Ek anlam

source: compositional phrases
ru: композиционные выражения
tr: kompozisyon ifadeleri

source: examples
ar: أمثلة
ru: примеры
tr: Örnekler

source: inflections
ru: словоформы
tr: çekimler

source: pronunciation
ru: произношение
tr: telaffuz

source: subcategorization
ru: подкатегоризация
tr: alt kategorizasyon

source: case
ru: падеж
tr: durum

source: register
ru: реестр
tr: Kayıt

source: geographical usage
ru: географическое применение
tr: coğrafi kullanım

source: mood
ru: оттенок
tr: mod

source: tense
ru: время
tr: zaman

source: homograph number
ru: колличество гомографов
tr: homograf numarası

source: semantic category
ru: семантическая категория
tr: anlamsal kategori

source: semantic subcategory
ru: семантическая подкатегория
tr: anlamsal alt kategori

source: range of application
ru: диапазон применения
tr: uygulama aralığı

source: sentiment
ru: настроение
tr: duygu

source: see
ru: смотрите
tr: bakın

source: see also
ru: смотрите также
tr: Ayrıca bakın

source: synonyms
ar: المرادفات
ru: синонимы
tr: Eş anlamlı

source: antonyms
ru: антонимы
tr: zıt anlamlı kelimeler

source: collocate
ru: размещено
tr: yerleştirilmiş

source: aspect
ru: выражение
tr: Görünüş

source: Select dictionary source and target language:
ar: حدد مصدر القاموس واللغة الهدف:
ru: Выберите исходный и целевой язык словаря:
tr: Sözlük için kaynak ve hedef dili seçin:

source: &Source language:
ar: لغة الم&صدر:
ru: &Исходный язык:
tr: &Kaynak dil:

source: &Target language:
ar: لغة ال&هدف:
ru: Язык &перевода:
tr: &Hedef dil:

source: Search in both headwords and &inflections
ru: Выполнять поиск в оборо&тах
tr: Hem başlıklarda hem de &çekimlerde ara

source: St&rip words to their stem
ru: Выполнять поиск однокоре&нных слов
tr: &Kelimeleri köklerine ayır

source: Show a&ll available translations
ru: Отображать &все имеющиеся переводы
tr: &Mevcut tüm çevirileri göster

source: Copy dictionary response to clip&board
ar: نسخ ناتج القاموس الى الحا&فظة
ru: Копировать результат в &буфер обмена
tr: Sözlük yanıtını &panoya kopyala

source: Auto-s&wap languages
ru: Автоматически изменять порядок я&зыков
tr: Dilleri otomatik de&ğiştir

source: &Username:
ru: Им&я пользователя:
tr: &Kullanıcı adı:

source: &Password:
ru: Па&роль:
tr: &Parola:

source: Register your own access token
ar: تسجيل رمز الوصول الخاص بك
ru: Зарегистрировать собственный код доступа
tr: Kendi erişim jetonunuzu alın

source: Yandex Dictionaries
ru: Словари Яндекс
tr: Yandex Sözlükleri

source: number
ar: رقم
ru: число
tr: numara

source: gender
ar: جنس
ru: пол
tr: Cinsiyet

source: Use &alternative server
ar: استخدام &خادم بديل
ru: Использовать альтернативный се&рвер
tr: &Alternatif sunucu kullan

source: &Dictionary Access Token:
ar: &رمز الوصول إلى القاموس:
ru: Код &доступа к онлайн-словарю:
tr: &Sözlük Erişim Jetonu:

source: Show
ru: Показать
tr: Göster

source: -- select language --
ar: -- اختار اللغة--
ru: -- выберите язык --
tr: -- Dil Seçin --

source: Hide
ru: Скрыть
tr: Gizle

source: Quick Dictionary
ar: القاموس السريع
ru: Быстрый словарь
tr: Çabuk Sözlük

source: Online Dictionary add-on for quick translation selected words or phrases.
ar: إضافة قاموس من على الإنترنت للترجمة السريعة للكلمات أو العبارات المختارة.
ru: Позволяет быстро получить перевод выбранного слова или словосочетания.
tr: Seçilen ya da seçim yoksa panoda bulunan kelime ya da ifadeler için çevrim içi çabuk sözlük eklentisi

source: announce the add-on help message
ar: إعلن عن رسالة تعليمات الوظيفة الإضافية

source: announce a list of all customized voice synthesizers profiles
ar: يعلن عن قائمة بجميع ملفات تعريف مُركِّبات الصوت المخصصة

source: Auto-&swap languages
ar: تبديل اللغات- &تلقائي
